app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Alex Cavalcante de Oliveira"], ["age", 25], ["created_at", "2022-08-11 11:30:08.895327"], ["updated_at", "2022-08-11 11:30:08.895327"]]
---
    def create
      user = User.create(
          name: params_users[:name],
          age: params_users[:age]
      )

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
      user = User.find(params_users[:id])

SELECT "users".* FROM "users"
---
    def show_all
        users = User.all.map do |user|

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "age" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Xela Oliveira"], ["age", 26], ["updated_at", "2022-08-11 12:06:35.931552"], ["id", 3]]
---
    def update
      user = User.find(params_users['id'])
      if verify_update_params && user
        user.update(params_users)